/* ======================================================================================================================
Модуль path
====================================================================================================================== */

// Як вам відомо, в сучасному світі існує далеко не одна операційна система:
// Windows, MacOS, різні дистрибутиви Linux тощо. І у всіх них може бути
// різний підхід для описання шляхів до файлів та папок, та і структура
// файлової системи в цілому. Було б непогано мати інструмент, який міг би
// уніфікувати роботу зі шляхами в незалежності від OS. Саме таким модулем
// і є node:path.

// Зверніть увагу!
// Модуль path не перевіряє, чи є за вказаним шляхом відповідний файл або
// папка, це лише інструмент для спрощення роботи зі шляхами!

// ----------------------------

// Основні методи, які можуть бути нам корисними при роботі зі шляхами

/* ======================================================================================================================
path.join(...paths[])
====================================================================================================================== */
// Цей метод приймає аргументами рядки, які будуть перетворені у правильно
// форматований шлях базуючись на операційній системі, на якій запущена програма.

// import path from 'node:path';

// // приклад для побудови шляху з його частин
// const somePath = path.join('some_folder', 'some_file.txt');

// // somePath буде 'some_folder/some_file.txt' на MacOs
// // somePath буде 'some_folder\\some_file.txt' на Windows

// -------------------------

// Ми можемо використовувати результат виконання одного виклику цієї функції в іншому виклику:

// import path from 'node:path';

// // приклад для побудови шляху із його частин
// // отримуємо шлях до кореневої директорії викликом метода process.cwd()
// const pathToWorkDir = path.join(process.cwd());

// // розширюємо шлях додатковими елементами
// const pathToFile = path.join(pathToWorkDir, 'some_folder', 'some_file.txt');

// // pathToFile на MacOs буде __шлях до папки, де запущений процес__/some_folder/some_file.txt'
// // pathToFile на Windows буде __шлях до папки, де запущений процес__\\some_folder\\some_file.txt'

// В наведеному прикладі ми працюємо із глобальною змінною process,
// яка містить всю інформацію про запущений процес node.js. Зокрема,
//  метод cwd() виведе абсолютний шлях до папки, де він запущений.

/* ======================================================================================================================
path.parse(path)
====================================================================================================================== */
// Дозволяє отримати інформацію по шляху, який був переданий аргументом

// import path from 'node:path';

// // на MacOs
// path.parse('/home/user/dir/file.txt');
// // { root: '/',
// //   dir: '/home/user/dir',
// //   base: 'file.txt',
// //   ext: '.txt',
// //   name: 'file' }

// // на Windows
// path.parse('C:\\\\path\\\\dir\\\\file.txt');
// // { root: 'C:\\\\',
// //   dir: 'C:\\\\path\\\\dir',
// //   base: 'file.txt',
// //   ext: '.txt',
// //   name: 'file' }

// Ми рекомендуємо за потреби звертатися до документації Node.js,
// щоб дізнаватися більше про цей модуль.
